app/controllers/contacts_controller.rb

SELECT  `contacts`.* FROM `contacts` WHERE `contacts`.`id` = 2 LIMIT 1
---
  def show
    @contact = Contact.find params[:id]

INSERT INTO `contacts` (`first_name`, `last_name`, `email`, `phone_number`, `created_at`, `updated_at`) VALUES ('hello', 'hello', 'hello', 'hello', '2015-03-03 20:23:43.025483', '2015-03-03 20:23:43.025483')
---
  def create
    @contact = Contact.new contact_params
    @contact.save

SELECT  `contacts`.* FROM `contacts` WHERE `contacts`.`id` = 45 LIMIT 1
---
  def edit
    @contact = Contact.find params[:id]

SELECT  `contacts`.* FROM `contacts` WHERE `contacts`.`id` = 0 LIMIT 1
UPDATE `contacts` SET `first_name` = 'update', `last_name` = 'this guy', `updated_at` = '2015-03-03 22:51:12.025052' WHERE `contacts`.`id` = 46
---
  def update
    @contact = Contact.find params[:id]
    @contact.update contact_params

SELECT  `contacts`.* FROM `contacts` WHERE `contacts`.`id` = 1 LIMIT 1
DELETE FROM `contacts` WHERE `contacts`.`id` = 1
---
  def destroy
    @contact = Contact.find params[:id]
    @contact.destroy